### 1.라이브러리 선언

In [1]:
import pandas as pd
import numpy as np

### 2.데이터 불러오기

In [2]:
csData = pd.read_csv("../dataset/customerdata.csv", encoding="ms949")
csData

     CUSTID     AVGPRICE  EMI  DEVICECOUNT  PRODUCTAGE          CUSTTYPE
0    A13566  4273.900000    3            6    1.679181  Big-Screen-lover
1    A14219  3642.441950    2            4    2.682023      Sleeping-dog
2    A15312  3653.884565    2            5    3.208202      Sleeping-dog
3    A16605  3713.211107    2            6    0.900000        Early-bird
4    B10634  3391.074215    2            4    2.453656      Sleeping-dog
..      ...          ...  ...          ...         ...               ...
145  Z13253  3678.800000    2            5    2.463670  Big-Screen-lover
146  Z13534  3662.437527    3            6    0.900000        Early-bird
147  Z16428  3516.500000    2            5    2.371301  Big-Screen-lover
148  Z16735  3300.100000    2            5    1.704942  Big-Screen-lover
149  Z19835  3326.526183    2            6    1.200000        Early-bird

[150 rows x 6 columns]

In [3]:
csData.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   CUSTID       150 non-null    object
 1   AVGPRICE     150 non-null    float64
 2   EMI          150 non-null    int64
 3   DEVICECOUNT  150 non-null    int64
 4   PRODUCTAGE   150 non-null    float64
 5   CUSTTYPE     150 non-null    object
dtypes: float64(2), int64(2), object(2)
memory usage: 7.2+ KB

In [4]:
### 리스트에서 데이터프레임 생성
productList = ["aProduct", "bProduct", "cProduct", "dProduct"]
priceList = [1000,2000,3000,4000]
zipList = zip(productList,priceList)
productInfoDf =  pd.DataFrame( zipList, columns=["productname","price"])
productInfoDf

  productname  price
0    aProduct   1000
1    bProduct   2000
2    cProduct   3000
3    dProduct   4000

In [5]:
### 딕셔너리에서 데이터프레임 생성
regionList = ["A01","A02","A03","A04","A05"]
yearweekList = list(range(201501,201506,1))
qtyList = list(range(100,600,100))
dictDf = { "REGIONID":regionList,
"YEARWEEK":yearweekList,
"QTY":qtyList}
dictDf = pd.DataFrame(dictDf)
dictDf

  REGIONID  YEARWEEK  QTY
0      A01    201501  100
1      A02    201502  200
2      A03    201503  300
3      A04    201504  400
4      A05    201505  500

In [6]:
# 데이터프레임 정보 확인
productInfoDf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   productname  4 non-null      object
 1   price        4 non-null      int64
dtypes: int64(1), object(1)
memory usage: 192.0+ bytes

In [7]:
# 데이터프레임의 컬럼 자료형 확인
productInfoDf.dtypes

productname    object
price           int64
dtype: object

## 1.원하는 행 조회하기

In [8]:
csDataEmi3 = csData.loc[(csData.EMI >= 3) & (csData.AVGPRICE > 3500)]
csData.loc[0:3]

   CUSTID     AVGPRICE  EMI  DEVICECOUNT  PRODUCTAGE          CUSTTYPE
0  A13566  4273.900000    3            6    1.679181  Big-Screen-lover
1  A14219  3642.441950    2            4    2.682023      Sleeping-dog
2  A15312  3653.884565    2            5    3.208202      Sleeping-dog
3  A16605  3713.211107    2            6    0.900000        Early-bird

In [9]:
csDataEmi3

     CUSTID     AVGPRICE  EMI  DEVICECOUNT  PRODUCTAGE          CUSTTYPE
0    A13566  4273.900000    3            6    1.679181  Big-Screen-lover
33   G16437  3787.328898    3            6    1.000000        Early-bird
40   H16326  3988.935304    3            6    0.900000        Early-bird
51   J10809  3676.135627    3            6    0.800000        Early-bird
67   N13273  3839.694732    3            6    1.100000        Early-bird
95   R16364  3592.353540    3            6    0.900000        Early-bird
107  S17396  3895.200000    3            6    2.055707  Big-Screen-lover
113  T11473  4165.700000    3            6    1.780674  Big-Screen-lover
126  V18566  3527.701867    3            6    0.900000        Early-bird
130  W13404  4296.873743    3            6    1.100000        Early-bird
146  Z13534  3662.437527    3            6    0.900000        Early-bird

In [10]:
# 행과 열의 개수를 바로 보여줌
csData.shape

(150, 6)

In [11]:
csDataEmi3.shape

(11, 6)

In [12]:
uiInputId = "a13566"

In [13]:
#대/소문자 변경
csData.loc[csData.CUSTID.str.upper() == uiInputId.upper()]

   CUSTID  AVGPRICE  EMI  DEVICECOUNT  PRODUCTAGE          CUSTTYPE
0  A13566    4273.9    3            6    1.679181  Big-Screen-lover

In [14]:
#데이터프레임 타입변환
#데이터프레임명['컬럼명'].astype(변경할 타입)
#데이터프레임명 = 데이터프레임명.astype({"컬럼명":변경할 타입})

In [15]:
customerData = csData

In [16]:
customerData.dtypes

CUSTID          object
AVGPRICE       float64
EMI              int64
DEVICECOUNT      int64
PRODUCTAGE     float64
CUSTTYPE        object
dtype: object

In [17]:
#존재하지않는 컬럼 방식
customerData["EMI2"] = customerData["EMI"].astype(float)

In [18]:
#존재하는 컬럼 변경
customerData.EMI = customerData.EMI.astype(str)

In [19]:
customerData.dtypes

CUSTID          object
AVGPRICE       float64
EMI             object
DEVICECOUNT      int64
PRODUCTAGE     float64
CUSTTYPE        object
EMI2           float64
dtype: object

In [20]:
csDataTypeStr = customerData.astype({"CUSTID":str, 
                    "AVGPRICE":str,
                    "EMI":str,
                    "DEVICECOUNT":str,
                    "PRODUCTAGE":str,
                    "CUSTTYPE":str,
                    "EMI2":str})

In [21]:
csDataTypeStr.dtypes

CUSTID         object
AVGPRICE       object
EMI            object
DEVICECOUNT    object
PRODUCTAGE     object
CUSTTYPE       object
EMI2           object
dtype: object

In [22]:
#원하는 행 조회 (컬럼 내 다중 포함 값)
emiCondition = ["2","3"]

answer1 = customerData[customerData.EMI.isin(emiCondition)] #in
answer2 = customerData[~customerData.EMI.isin(emiCondition)] #not in

In [23]:
textDf = ["A"]

angryCustomer = pd.DataFrame( list( csData.CUSTID[0:3]),columns = ["CSID"])

angryList = list(angryCustomer.CSID)

csData.loc[~csData.CUSTID.isin(angryList)].shape

(147, 7)

In [24]:
#원하는 행 조회 (인덱스)
specificIndex = [1,3]
answer1 = customerData.loc[ specificIndex ]
answer2 = customerData.loc[ 1:3 ] 
answer3 = customerData.loc[ : ] 
print(len(answer1))
print(len(answer2))
print(len(answer3))

2
3
150

## 2.원하는 컬럼 조회하기

In [25]:
import pandas as pd
# CSV 파일을 읽어 Data Frame 변수에 저장하기
customerData = pd.read_csv("../dataset/customerData.csv")
# 타겟 컬럼 정의 및 조회
targetColumns = ["CUSTID","AVGPRICE"]
customerDataC = customerData.loc[ : , targetColumns ]
# 데이터 VIEW
customerDataC.head(2)

   CUSTID    AVGPRICE
0  A13566  4273.90000
1  A14219  3642.44195

In [26]:
customerDataC2 = customerDataC.copy()

In [27]:
customerData.iloc[: , 0:3] # 3은 포함되지않음

     CUSTID     AVGPRICE  EMI
0    A13566  4273.900000    3
1    A14219  3642.441950    2
2    A15312  3653.884565    2
3    A16605  3713.211107    2
4    B10634  3391.074215    2
..      ...          ...  ...
145  Z13253  3678.800000    2
146  Z13534  3662.437527    3
147  Z16428  3516.500000    2
148  Z16735  3300.100000    2
149  Z19835  3326.526183    2

[150 rows x 3 columns]

## 3. 인덱스 설정하기

In [28]:
#인덱스 사용시: 형상 변경이 유연함
#값 사용시: 가독성이 좋다.

In [29]:
#인덱스 초기화
emi3Data = customerData.loc[customerData.EMI == 3]
#(inplace=True)바꾼다면 즉시 변수에 반영한다
emi3DataReset = emi3Data.reset_index(drop=True,inplace=True)
#(drop=True) 기존 인덱스 드롭

In [33]:
#인덱스 설정하기
customerData.set_index(keys=["CUSTID"])

           AVGPRICE  EMI  DEVICECOUNT  PRODUCTAGE          CUSTTYPE
CUSTID
A13566  4273.900000    3            6    1.679181  Big-Screen-lover
A14219  3642.441950    2            4    2.682023      Sleeping-dog
A15312  3653.884565    2            5    3.208202      Sleeping-dog
A16605  3713.211107    2            6    0.900000        Early-bird
B10634  3391.074215    2            4    2.453656      Sleeping-dog
...             ...  ...          ...         ...               ...
Z13253  3678.800000    2            5    2.463670  Big-Screen-lover
Z13534  3662.437527    3            6    0.900000        Early-bird
Z16428  3516.500000    2            5    2.371301  Big-Screen-lover
Z16735  3300.100000    2            5    1.704942  Big-Screen-lover
Z19835  3326.526183    2            6    1.200000        Early-bird

[150 rows x 5 columns]

## 4.데이터 조작하기

In [34]:
import numpy as np

In [35]:
### 데이터조작방법
#1. np.where 조작한다. (* 복잡한 로직에는 힘들어진다)
#2. 함수를 활용하여 조작한다 (*복잡한 로직에도 강하다!)
#3. loc 함수를 활용해서 조작한다. (* 가독성이 뛰어나난 속도가 떨어짐)
#4. map함수를 사용할수도 있다. (머신러닝에서 많이 사용된다!)

In [36]:
#### 1.
customerData["PRODUCTAGE_NEW"] = \
    np.where(customerData.PRODUCTAGE < 1, 1, \
            np.where( customerData.PRODUCTAGE < 2, 2, 3))

In [37]:
##### 2.
# 함수정의
# inputValue < 1: 1
# 1 <= inputValue < 2 : 2
# inputValue >= 2 3

In [38]:
def valueClustering(inValue):
    #inValue = 0.3
    outValue = inValue

    if inValue < 1:
        outValue = 1
    elif inValue < 2:
        outValue =2
    else:
        outValue = 3
    return outValue

In [39]:
customerData["PRODUCTAGE_NEW"] = customerData.PRODUCTAGE.apply(valueClustering)

In [40]:
#### 3.loc
customerData.loc[ customerData.PRODUCTAGE < 1, "PRODUCTAGE_NEW"] = 1

In [41]:
customerData.loc [ (customerData.PRODUCTAGE >= 1) & \
                (customerData.PRODUCTAGE_NEW < 2),\
                 "PRODUCTAGE_NEW"] = 2

In [42]:
customerData.loc[(customerData.PRODUCTAGE >= 2), "PRODUCTAGE_NEW"] = 3

In [43]:
#### 4. map 함수~

In [44]:
featuresData = \
    pd.read_csv("../dataset/feature_regression_example.csv")

In [45]:
ynMap = {"Y":1, "N":0}

In [46]:
featuresData["HOLIDAY_NEW"] = featuresData.HOLIDAY.map(ynMap)

In [47]:
featuresData.head(2)

,REGIONID,PRODUCTGROUP,PRODUCT,ITEM,YEARWEEK,YEAR,WEEK,QTY,HOLIDAY,HCLUS,PROMOTION,PRO_PERCENT,HOLIDAY_NEW
0,SEOUL_BANK_001,PG02,PRODUCT0010,ITEM0115,201501,2015,1,1225,Y,1,Y,0.209442,1
1,SEOUL_BANK_001,PG02,PRODUCT0010,ITEM0115,201502,2015,2,968,N,4,Y,0.209442,0

### 5. 데이터 컬럼간 연산하기

In [48]:
customerData["NEW_COLUMN"] = customerData.CUSTID.str.lower()+"_"+customerData.EMI.astype(str)
customerData.head()

,CUSTID,AVGPRICE,EMI,DEVICECOUNT,PRODUCTAGE,CUSTTYPE,PRODUCTAGE_NEW,NEW_COLUMN
0,A13566,4273.900000,3,6,1.679181,Big-Screen-lover,2,a13566_3
1,A14219,3642.441950,2,4,2.682023,Sleeping-dog,3,a14219_2
2,A15312,3653.884565,2,5,3.208202,Sleeping-dog,3,a15312_2
3,A16605,3713.211107,2,6,0.900000,Early-bird,1,a16605_2
4,B10634,3391.074215,2,4,2.453656,Sleeping-dog,3,b10634_2

### 6. 데이터 정렬하기

In [50]:
customerData.columns

Index(['CUSTID', 'AVGPRICE', 'EMI', 'DEVICECOUNT', 'PRODUCTAGE', 'CUSTTYPE',
       'PRODUCTAGE_NEW', 'NEW_COLUMN'],
      dtype='object')

In [51]:
sortKey = ["EMI","AVGPRICE"]

In [55]:
#inplace=True, customerData에 바로 반영이됨.
#ignore_index=True 는 바뀐 인덱스 무시
sortedData = customerData.sort_values(by=sortKey,
                                     ascending=[True,True],
                                     inplace=False, ignore_index=True)

In [56]:
sortedData

,CUSTID,AVGPRICE,EMI,DEVICECOUNT,PRODUCTAGE,CUSTTYPE,PRODUCTAGE_NEW,NEW_COLUMN
0,N14862,2390.083736,1,6,1.000000,Early-bird,2,n14862_1
1,I17056,2963.370122,1,3,2.139196,Sleeping-dog,3,i17056_1
2,Y12458,2976.211190,1,3,2.199677,Sleeping-dog,3,y12458_1
3,O13586,2980.229239,1,3,2.038603,Sleeping-dog,3,o13586_1
4,Q16449,3048.308860,1,3,2.369758,Sleeping-dog,3,q16449_1
...,...,...,...,...,...,...,...,...
145,S17396,3895.200000,3,6,2.055707,Big-Screen-lover,3,s17396_3
146,H16326,3988.935304,3,6,0.900000,Early-bird,1,h16326_3
147,T11473,4165.700000,3,6,1.780674,Big-Screen-lover,2,t11473_3
148,A13566,4273.900000,3,6,1.679181,Big-Screen-lover,2,a13566_3
149,W13404,4296.873743,3,6,1.100000,Early-bird,2,w13404_3

### 7.데이터 그룹별 집계함수 구현 (GROUP BY)

In [ ]:
# a. 분석/예측하려는 목적의 데이터가 알맞은 레벨로 있느냐를 판단

In [58]:
#데이터프레임명.groupby(by=['그룹키 컬럼'])["집계대상 컬럼"].agg(["집계함수"])

In [59]:
# 무이자할부(EMI) 기준 평균지출비용(AVGPRICE)의 평균 산출
groupKey = ["EMI"]
meanValue = customerData.\
groupby(by=groupKey)\
["AVGPRICE"].\
agg(["mean"])

# 컬럼명 변경 (mean -> MEAN_AVGPRICE)
meanValue.rename(columns={"mean":"MEAN_AVGPRICE"}, 
inplace=True)

# 인덱스 초기화
meanValue.reset_index(inplace=True)
meanValue

   EMI  MEAN_AVGPRICE
0    1    3119.031810
1    2    3441.429664
2    3    3559.487188

### 8.고급연산 (이동집계함수)

In [61]:
#이동편균 산출 방법
#데이터프레임명["컬럼명"].rolling(window=5(구간), center=True(기준점), min_periods=1(최소구간)).mean()

In [ ]:
sortedData["MAS_BASIC"] = sortedData.QTY.rolling(window=5,
                      min_periods=1,
                      center=True).mean()

sortedData

# 데이터프레임명[컬럼명] = 데이터.컬럼명.이동평균산출(구간, 최소구간, 기준점). 함수() - rolling를 실행해라
sortedData["MA5"] = sortedData.QTY.rolling(window=5, min_periods=1, center=True).mean()
# min_periods 최소구간이 지정되어있지 않으면 구간(5)의 중앙(3) / 초기값 왼쪽(0,1)부분이 NaN값이 나옴 
# center가 False인 경우 뒤부터 시작해 앞 4개의 값이 없음
sortedData["MA5_1"] = sortedData.QTY.rolling(window=5, center=True).mean()

# np.where, function
sortedData["EFFECT"] = sortedData.QTY / sortedData.MA5

# drop_duplicates#는 distinct와 같음
sortedData.YEAR.drop_duplicates()

groupKey = ["REGIONID","PRODUCT","WEEK"]

ratioData = sortedData.groupby(groupKey)[["EFFECT"]].agg("mean").reset_index()

#다른제품에 영향이 끼치면 rolling~
#groupby(지역,상품).rolling~

### 9. 데이터병합

In [3]:
import pandas as pd
# CSV 파일을 읽어 Data Frame 변수에 저장하기
joinSellout = pd.read_csv("../dataset/join_kopo_product_volume.csv")
print(joinSellout.head())

  REGIONID PRODUCT  YEARWEEK   QTY
0      A01  ST0001    201901  3000
1      A01  ST0001    201902  3500
2      A02  ST0002    201901  4000
3      A02  ST0003    201902  7000

In [2]:
# CSV 파일을 읽어 Data Frame 변수에 저장하기
joinMaster = pd.read_csv("../dataset/join_region_master.csv", encoding = 
"ms949") 
print(joinMaster.head())

  REGIONID REGIONNAME
0      A01         한국
1      A02         미국
2      A03        프랑스
3      A04         독일

In [5]:
mergeResult = pd.merge(left = joinSellout,
right = joinMaster,
on="REGIONID",
how="inner")\
[["REGIONID","REGIONNAME","PRODUCT","YEARWEEK",
"QTY"]]
mergeResult.head()

  REGIONID REGIONNAME PRODUCT  YEARWEEK   QTY
0      A01         한국  ST0001    201901  3000
1      A01         한국  ST0001    201902  3500
2      A02         미국  ST0002    201901  4000
3      A02         미국  ST0003    201902  7000

In [6]:
pd.merge(left = joinSellout,
right = joinMaster,
on="REGIONID",
how="inner")

  REGIONID PRODUCT  YEARWEEK   QTY REGIONNAME
0      A01  ST0001    201901  3000         한국
1      A01  ST0001    201902  3500         한국
2      A02  ST0002    201901  4000         미국
3      A02  ST0003    201902  7000         미국

In [ ]:
#조인 키 = 중복이 허락하지않는 기본키여야한다

In [7]:
testMaster = joinMaster.loc[0:1]

In [8]:
testMaster.loc[testMaster.REGIONID=="A02", "REGIONID"] = "A01"

C:\Users\SMART-09\anaconda3\lib\site-packages\pandas\core\indexing.py:1637: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_block(indexer, value, name)
C:\Users\SMART-09\anaconda3\lib\site-packages\pandas\core\indexing.py:692: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  iloc._setitem_with_indexer(indexer, value, self.name)

In [9]:
pd.merge(left = joinSellout,
right = testMaster,
on="REGIONID",
how="inner")

  REGIONID PRODUCT  YEARWEEK   QTY REGIONNAME
0      A01  ST0001    201901  3000         한국
1      A01  ST0001    201901  3000         미국
2      A01  ST0001    201902  3500         한국
3      A01  ST0001    201902  3500         미국

In [4]:
joinMaster.rename(columns={"REGIONID":"AP2ID"},inplace=True)

In [12]:
pd.merge(left=joinSellout,
        right=joinMaster,
        left_on="REGIONID",
        right_on="AP2ID",
        how="inner")

  REGIONID PRODUCT  YEARWEEK   QTY AP2ID REGIONNAME
0      A01  ST0001    201901  3000   A01         한국
1      A01  ST0001    201901  3000   A01         미국
2      A01  ST0001    201902  3500   A01         한국
3      A01  ST0001    201902  3500   A01         미국

In [14]:
joinMaster2 = joinMaster.loc[joinMaster.AP2ID=="A01"]

In [15]:
pd.merge(left=joinSellout,
        right=joinMaster2,
        left_on="REGIONID",
        right_on="AP2ID",
        how="inner")

  REGIONID PRODUCT  YEARWEEK   QTY AP2ID REGIONNAME
0      A01  ST0001    201901  3000   A01         한국
1      A01  ST0001    201901  3000   A01         미국
2      A01  ST0001    201902  3500   A01         한국
3      A01  ST0001    201902  3500   A01         미국

In [5]:
#EX2)
joinMaster.loc[4,"AP2ID"] = "A05"

In [6]:
joinMaster.loc[4,"REGIONNAME"] = "인도"

In [7]:
joinMaster2 = joinMaster.loc[joinMaster.AP2ID=="A01"]

In [8]:
pd.merge(left=joinSellout,
        right=joinMaster2,
        left_on="REGIONID",
        right_on="AP2ID",
        how="outer")

  REGIONID PRODUCT  YEARWEEK   QTY AP2ID REGIONNAME
0      A01  ST0001    201901  3000   A01         한국
1      A01  ST0001    201902  3500   A01         한국
2      A02  ST0002    201901  4000   NaN        NaN
3      A02  ST0003    201902  7000   NaN        NaN

In [9]:
columnList = ["REGIONID","PRODUCT","DATE","QTY"]

In [10]:
data1 = pd.DataFrame(
[["서울","AA카드", 20210518, 100],
["서울","AA카드", 20210517, 200],
["서울","AA카드", 20210516, 300],
["서울","AA카드", 20210515, 400],
["서울","AA카드", 20210514, 500]
], columns=columnList)

data1

  REGIONID PRODUCT      DATE  QTY
0       서울    AA카드  20210518  100
1       서울    AA카드  20210517  200
2       서울    AA카드  20210516  300
3       서울    AA카드  20210515  400
4       서울    AA카드  20210514  500

In [11]:
data3 = data1.copy()

In [36]:
data2.REGIONID = "서울"

In [37]:
data2

  REGIONID PRODUCT      DATE  QTY
0       서울    BB카드  20210518  100
1       서울    BB카드  20210517  200
2       서울    BB카드  20210516  300
3       서울    BB카드  20210515  400
4       서울    BB카드  20210514  500

In [42]:
data3.REGIONID =  "부산"

In [43]:
data3

  REGIONID PRODUCT      DATE  QTY
0       부산    BB카드  20210518  100
1       부산    BB카드  20210517  200
2       부산    BB카드  20210516  300
3       부산    BB카드  20210515  400
4       부산    BB카드  20210514  500

In [23]:
data4 = data3.copy()

In [44]:
data4.PRODUCT = "CC카드"

In [45]:
data4

  REGIONID PRODUCT      DATE  QTY
0       부산    CC카드  20210518  100
1       부산    CC카드  20210517  200
2       부산    CC카드  20210516  300
3       부산    CC카드  20210515  400
4       부산    CC카드  20210514  500

In [46]:
mergedData = data1.append(data2).append(data3).append(data4)

In [47]:
promotionColumns = ["SUBSIDIARY","CARD_NAME","PROMOTION_NAME","PROMOTION_RATE"]

In [53]:
promotion = pd.DataFrame([
    ["서울","AA카드","서울_프로모션",0.5],
    ["부산","BB카드","부산_프로모션",0.3],
    ["부산","CC카드","부산_프로모션",0.25]
    
],columns = promotionColumns)

In [54]:
promotion

  SUBSIDIARY CARD_NAME PROMOTION_NAME  PROMOTION_RATE
0         서울      AA카드        서울_프로모션            0.50
1         부산      BB카드        부산_프로모션            0.30
2         부산      CC카드        부산_프로모션            0.25

In [55]:
promotion.rename(columns={"SUBSIDIARY":"REGIONID"},inplace=True)

In [56]:
promotion.rename(columns={"CARD_NAME":"PRODUCT"},inplace=True)

In [57]:
pd.merge(left=mergedData,
        right=promotion,
        on=("REGIONID","PRODUCT"),
        how="outer")

   REGIONID PRODUCT      DATE  QTY PROMOTION_NAME  PROMOTION_RATE
0        서울    AA카드  20210518  100        서울_프로모션            0.50
1        서울    AA카드  20210517  200        서울_프로모션            0.50
2        서울    AA카드  20210516  300        서울_프로모션            0.50
3        서울    AA카드  20210515  400        서울_프로모션            0.50
4        서울    AA카드  20210514  500        서울_프로모션            0.50
5        서울    BB카드  20210518  100            NaN             NaN
6        서울    BB카드  20210517  200            NaN             NaN
7        서울    BB카드  20210516  300            NaN             NaN
8        서울    BB카드  20210515  400            NaN             NaN
9        서울    BB카드  20210514  500            NaN             NaN
10       부산    BB카드  20210518  100        부산_프로모션            0.30
11       부산    BB카드  20210517  200        부산_프로모션            0.30
12       부산    BB카드  20210516  300        부산_프로모션            0.30
13       부산    BB카드  20210515  400        부산_프로모션            0.30
14       부산    BB카드  20210514  500        부산_프로모션            0.30
15       부산    CC카드  20210518  100        부산_프로모션            0.25
16       부산    CC카드  20210517  200        부산_프로모션            0.25
17       부산    CC카드  20210516  300        부산_프로모션            0.25
18       부산    CC카드  20210515  400        부산_프로모션            0.25
19       부산    CC카드  20210514  500        부산_프로모션            0.25